List birds = [
  {"name": "นกกะดง", "img": "assets/pigeon.jpg", "id": 0},
  {"name": "นกแก้วโม่ง", "img": "assets/alex.jpg", "id": 1},
  {"name": "นกยูง", "img": "assets/peacock.jpg", "id": 2},
  {"name": "นกกะรางหัวขวาน", "img": "assets/hoopoes.jpg", "id": 3},
  {"name": "นกหัวโต", "img": "assets/plover.jpg", "id": 4},
  {"name": "นกกระทุง", "img": "assets/pelican.jpg", "id": 5},
  {"name": "นกอีก๋อย", "img": "assets/whim.jpg", "id": 6},
  {"name": "นกขมิ้น", "img": "assets/canary.jpg", "id": 7},
  {"name": "นกสาริกาเขียว", "img": "assets/magpie.jpg", "id": 8},
  {"name": "นกแสก", "img": "assets/owl.jpg", "id": 9},
];

List birdsData = [
  {
    "name_th": "นกกะดง",
    "name_eng": "Nicobar pigeon หรือ Nicobar dove",
    "interesting_in":
        "อยู่ในวงศ์เดียวกับนกพิราบ ตัวผู้และตัวเมียมีลักษณะคล้ายกัน ตัวเต็มวัยมีขนสีเข้ม ปางและขนคลุมโคนหางด้านล่างสีขาว ขนทั่วตัวสีเขียวเหลือบเหลืองและม่วง ปลายปีกสีดำน้ำเงิน มีขนสร้อยคอยาว ตัวเมียขนสร้อยคอสั้นกว่าของตัวผู้เล็กน้อย มีหางสั้นมากสีเขียวเหลือบดำ",
    "habitat":
        "พบในหมู่เกาะอันดามัน มาเลเซีย โซโลมอน ฟิลิปปินส์ ไทย กัมพูชา ในประเทศไทยพบตามเกาะทางภาคใต้ ทางฝั่งอันดามัน เช่น หมู่เกาะสุรินทร์ หมู่เกาะสิมิลัน",
    "food": "อาหารได้แก่ เมล็ดพืช ผลไม้ที่หล่นตามพื้นดิน",
    "behavior":
        "ชอบอาศัยและหากินบนพื้นดินมากกว่าบนต้นไม้ อาจหากินอยู่ตัวเดียว เป็นคู่หรือฝูงเล็กๆ 3-4 ตัว บางครั้งก็พบเป็นฝูงใหญ่ 20-30 ตัว บินได้เก่งพอสมควร ไม่ชอบร้อง นาน ๆ จึงจะได้ยินเสียงร้องครั้งหนึ่ง",
  },
  {
    "name_th": "นกแก้วโม่ง",
    "name_eng": "Alexandrine parakeet หรือ Alexandrine parrot",
    "interesting_in":
        "เป็นนกแก้วที่ขนหางคู่กลางยาวมาก ตัวผู้มีขนาดใหญ่กว่าตัวเมีย หางเล็กเรียวยาว ลำตัวสีเขียว จะงอยปากอวบอูม ปลายปากงุ้มลงสีแดง มีแถบสีแดงบริเวณหัวปีก นกตัวผู้มีแถบแดงเล็ก ๆ บริเวณคอด้านหลัง และมีแถบดำบริเวณคอด้านหน้า ซึ่งไม่มีในนกตัวเมีย ใต้หางสีเหลืองคล้ำ ใบหน้าและลำคอสีปนเหลือง",
    "habitat":
        "พบในอินเดีย ชอบอยู่อาศัยบริเวณ ป่าเบญจพรรณ ป่าดิบแล้ง ป่าเต็งรัง ป่ารุ่น เขตแพร่กระจายสามารถพบเห็นได้ที่ พม่า อันดามัน ลาว อินโดจีน ในประเทศไทยพบได้ทุกภาค ยกเว้นภาคใต้",
    "food":
        "ผลไม้ที่มีเปลืองอ่อนนุ่ม และเปลืองแข็ง เมล็กธัญพืช เมล็ดพืช ใบไม้ และผลผลิตทางการเกษตรอื่น ๆ",
    "behavior":
        "สามารถใช้ปากเกาะเกี่ยวเคลื่อนตัวไปตามกิ่งไม้ได้ดี หากินอยู่รวมกันเป็นฝูงเล็ก ๆ แต่อาจพบชุมนุมเป็นฝูงหใญ่มากในบริเวณแหล่งอาหารต่าง ๆ ปกติจะพบอยู่เฉพาะในฝูงนกแก้วโม่งด้วยกันเท่านั้นไม่ปะปนกับนกแก้วชนิดอื่น ๆ นอนบนต้นไม้เป็นกลุ่มใหญ่ เป็นนกที่บินได้ดีและเร็ว ส่งเสียงร้องกันระงม สามารถพูดได้เมื่อนำมาเลี้ยงให้เชื่อง เวลาบินจะบินเป็นฝูงเล็กๆ 8-10 ตัว ชอบเกาะตามยอดไม้"
  },
  {
    "name_th": "นกยูง",
    "name_eng": "Peafowl",
    "interesting_in":
        "เพศผู้และเพศเมียมีหงอนเป็นพู่สีเหลืองชี้ตรงอยู่บนหัว ต่างจากนกยูงอินเดียซึ่งเป็นรูปพัด บนหัวและคอเป็นขนสั้น ๆ สีเขียวเหลือบน้ำเงิน หน้ามีสีฟ้า ดำ และเหลือง ขนคอ หน้าอกและหลังตรงกลาง ขนมีเหลือบน้ำเงินแก่ล้อมด้วยสีเขียวและสีทองแดง นกยูงตัวผู้มีแพนขนปิดหางยาวหลายเส้น ตรงปลายมีดอกดวง 'แววมยุรา' ตรงกลางดวงมีสีน้ำเงินแกมดำอยู่ภายในพื้นวงกลมเหลือบเขียว",
    "habitat":
        "นกยูงมีการกระจายพันธุ์ในรัฐอัสสัม ประเทศอินเดีย ด้านตะวันตกเฉียงใต้ของประเทศจีน เอเชียตะวันออกเฉียงใต้ และเกาะชวา ในประเทศไทยพบในภาคเหนือและภาคตะวันต",
    "food":
        "นกยูงกินทั้งพืชและสัตว์ ได้แก่ เมล็ดหญ้า เมล็ดของไม้ต้น ธัญพืช ผลไม้สุก แมลง ตัวหนอน ไส้เดือน งู และสัตว์ขนาดเล็ก",
    "behavior":
        "นกยูงอาศัยตามป่าทั่วไปในระดับความสูงไม่เกิน 1,000 เมตรจากระดับน้ำทะเล พบอยู่เป็นฝูงเล็กๆ หลังช่วงฤดูผสมพันธุ์มักพบตัวเมียอยู่กับลูกตามลำพัง มักออกหากินในช่วงเช้าและบ่าย ตามชายป่าและริมลำธาร ตอนกลางคืนมักจับคอนนอนตามกิ่งไม้ค่อนข้างสูง"
  },
  {
    "name_th": "นกกะรางหัวขวาน",
    "name_eng": "Hoopoe",
    "interesting_in":
        "มีลักษณะเด่นที่จำง่ายคือ มีหงอนคล้ายหมวกของพวกอินเดียแดงในอเมริกาสมัยก่อน ลำตัวมีลายขวางสีน้ำตาลอ่อน หรือขาวสลับดำ ปากยาวเรียวโค้ง ซึ่งมีลักษณะเหมือนกันทั้งตัวผู้และตัวเมีย แต่ตัวเมียจะมีขนาดเล็กกว่า และสีจางกว่าตัวผู้เล็กน้อย ขณะแม่นกกกลูกอยู่ในรัง จะมีต่อมขับของเหลวที่มีกลิ่นเหม็นออกมา กลิ่นนี้มาจากต่อมน้ำมันไต้ขน เชื่อกันว่านกกะรางหัวขวานใช้กลิ่นเหม็นนี้ป้องกันตัวไม่ให้สัตว์อื่นเข้าใกล้",
    "habitat": "เป็นนกประจำถิ่นที่พบทั่วประเทศไทย",
    "food": "อาหารได้แก่ แมลง และตัวอ่อนของแมลง",
    "behavior":
        "ชอบอยู่ตามทุ่งโล่ง ป่าเบญจพรรณ ป่าละเมาะ และพื้นที่เกษตรกรรม ทุ่งนาที่พอมีต้นไม้อยู่บ้าง อาจอยู่รวมกันเป็นฝูง ชอบส่งเสียงร้อง 'ฮูป ฮูป ฮูป' หรือ 'ฮูป ปู ปู' เวลาเดินส่ายหัวไปมา คุ้ยเขี่ยหาแมลงและหนอนตามพื้นดิน ไม่ชอบอาบน้ำ แต่ชอบอาบทรายร้อนๆ แทนอาบน้ำ"
  },
  {
    "name_th": "นกหัวโต",
    "name_eng": "Grey plover",
    "interesting_in":
        "หัวค่อนข้างโต หัวและลำตัวเทาแกมน้ำตาล หน้าผากและคิ้วขาว หลังมีจุดคล้ำเล็ก ๆ จากขอบขนสีขาว ลำตัวด้านล่างขาว อกและสีข้างเทามีลายขีดจาง ๆ ขณะบินใต้ปีกขาว มีแถบดำที่รักแร้ ชุดขน",
    "habitat":
        "พื้นที่ชุ่มน้ำ ริมหนองบึง ทะเลสาบ มีรายงานการพบเฉพาะที่เขตห้ามล่าสัตว์ป่าบึงบอระเพ็ด จังหวัดนครสวรรค์ เท่านั้น",
    "food":
        "ส่วนอาหาร ได้แก่ แมลง ตัวหนอน สัตว์น้ำต่าง ๆ เช่น หอย ปู ปลา กุ้ง บางครั้งกินผล ยอด และต้นอ่อนของพืชที่ขึ้นในน้ำเค็มบางชนิด กินอาหารด้วยการวิ่งในระยะทางที่สั้น ๆ และหยุด แล้วเก็บอาหารด้วยปากแทนที่จะใช้เทคนิคการจับเหยื่อแบบทั่วไป",
    "behavior":
        "พบการรวมฝูงเป็นฝูงขนาดเล็กหรือกลาง ตั้งแต่ 2-50 ตัว แต่อาจพบการสะสมฝูงได้ถึง 1,000 ตัวในจุดแวะพัก หากินในช่วงน้ำลงทั้งกลางวันและกลางคืน บินได้ดีมากและเร็ว เมื่อถูกรบกวนจะบินหนีในทันที อาจหากินอยู่รวมกับนกชายเลนอื่น ๆ"
  },
  {
    "name_th": "นกกระทุง",
    "name_eng": "Pelican",
    "interesting_in":
        "ตัวผู้และตัวเมียมีลักษณะคล้ายกัน แต่ตัวผู้มีขนาดใหญ่กว่าตัวเมีย ปากยาวและแบน มีถุงน้ำใต้คอสีม่วงอ่อน ขอบปากด้านบนมีจุดสีฟ้าคล้ำๆ เรียงกัน ขาสั้นสีน้ำตาลและมีเยื่อยึดอยู่ระหว่างนิ้วทั้งสี่ ใช้สำหรับว่ายน้ำ ขณะบินจะหดคอแนบเข้ามาและวางหัวไว้บนไหล่ ขนตามลำตัวสีเทาอ่อน บริเวณขอบตาสีขาว",
    "habitat":
        "เป็นนกค่อนข้างหายาก ในประเทศไทยพบตามแหล่งน้ำขนาดใหญ่ แม่น้ำ บางครั้งพบริมทะเล นอกจากนี้ยังพบในแถบอินโดแปซิฟิก อินเดีย พม่า อินโดจีน และชวา",
    "food": "อาหารได้แก่ ปลา สัตว์สะเทินน้ำสะเทินบกตามแหล่งน้ำขนาดใหญ่",
    "behavior":
        "ชอบอาศัยอยู่รวมกันเป็นฝูงทั้งช่วงเวลาหากินและทำรัง ขณะหาอาหารจะใช้ถุงใต้คอทำหน้าที่คล้ายสวิงช้อนปลาลงในลำคอ"
  },
  {
    "name_th": "นกอีก๋อย",
    "name_eng": "Eurasian whimbrel",
    "interesting_in":
        "ปากสีน้ำตาล ยาวมากปลายปากโค้ง หัว คอ หน้าอกสีน้ำตาลอ่อน มีลายสีน้ำตาลเข้มกระจายทั่วตัว โดยเฉพาะ หลังและปีก ลายจะใหญ่และสีเข้ม ตะโพก คาง และลำตัวด้านล่างสีขาว ขาสีขาวขาสีเทาถึงเข้ม",
    "habitat": "",
    "food": "",
    "behavior": ""
  },
  {
    "namt_th": "นกขมิ้น",
    "name_eng": "Canary",
    "interesting_in": "",
    "habitat": "",
    "food": "",
    "behavior": ""
  },
  {
    "name_th": "นกสาริกาเขียว",
    "name_eng": "Green Javan Magpie",
    "interesting_in": "",
    "habitat": "",
    "food": "",
    "behavior": ""
  },
  {
    "name_th": "นกแสก",
    "name_eng": "Barn Owl",
    "interesting_in": "",
    "habitat": "",
    "food": "",
    "behavior": ""
  },
];
